In [243]:
import pandas as pd

#  Cyclonic Storm Data

Data is sourced from the Hurricane Research Division of the [Atlantic Oceanographic & Metereological Laboratory](https://www.aoml.noaa.gov/hrd/hurdat/International_Hurricanes.html).

## Hurricanes

### Non-US Landfalls

Hurricane data source for [Non-US landfalls](https://www.aoml.noaa.gov/hrd/hurdat/International_Hurricanes.html).

In [244]:
hurricanes_non_us_landfalls_df = pd.read_csv('International_Atlantic _Hurricane_Landfalls.csv', parse_dates=['Date'], infer_datetime_format=True, delimiter='\t')
hurricanes_non_us_landfalls_df.head()

/var/folders/b7/jtfw7lbj0mn18fznly0bdtq00000gn/T/ipykernel_2504/2849656789.py:1: FutureWarning: The argument 'infer_datetime_format' is deprecated and will be removed in a future version. A strict version of it is now the default, see https://pandas.pydata.org/pdeps/0004-consistent-to-datetime-parsing.html. You can safely remove this argument.
  hurricanes_non_us_landfalls_df = pd.read_csv('International_Atlantic _Hurricane_Landfalls.csv', parse_dates=['Date'], infer_datetime_format=True, delimiter='\t')

,Index,Date,Time,Latitude,Longitude,Max Winds(kt),SS HWS,Central Pressure(mb),Landfall Country,Storm Names
0,5,1990-08-07,1700Z,20.9N,97.0W,85.0,2.0,980.0,Mexico,Diana
1,1991,NaT,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,4,1992-08-23,2100Z,25.4N,76.6W,140.0,5.0,923.0,Bahamas,Andrew
3,4,1992-08-24,0100Z,25.4N,77.8W,130.0,4.0,931.0,Bahamas,Andrew
4,8,1993-09-20,2100Z,21.2N,97.5W,85.0,2.0,970.0,Mexico,Gert

In [245]:
hurricanes_non_us_landfalls_df = hurricanes_non_us_landfalls_df.drop(columns=['Index', 'Latitude', 'Longitude', 'SS HWS', 'Time']).dropna().drop_duplicates()
hurricanes_non_us_landfalls_df.reset_index(drop=True, inplace=True)
hurricanes_non_us_landfalls_df.head()

        Date  Max Winds(kt)  Central Pressure(mb) Landfall Country Storm Names
0 1990-08-07           85.0                 980.0           Mexico       Diana
1 1992-08-23          140.0                 923.0          Bahamas      Andrew
2 1992-08-24          130.0                 931.0          Bahamas      Andrew
3 1993-09-20           85.0                 970.0           Mexico        Gert
4 1995-09-05          115.0                 945.0          Barbuda        Luis

In [246]:
hurricanes_non_us_landfalls_df['Year'] = hurricanes_non_us_landfalls_df['Date'].dt.year
hurricanes_non_us_landfalls_df

,Date,Max Winds(kt),Central Pressure(mb),Landfall Country,Storm Names,Year
0,1990-08-07,85.0,980.0,Mexico,Diana,1990
1,1992-08-23,140.0,923.0,Bahamas,Andrew,1992
2,1992-08-24,130.0,931.0,Bahamas,Andrew,1992
3,1993-09-20,85.0,970.0,Mexico,Gert,1993
4,1995-09-05,115.0,945.0,Barbuda,Luis,1995
...,...,...,...,...,...,...
131,2022-09-19,80.0,976.0,Dominican Republic,Fiona,2022
132,2022-09-20,100.0,962.0,Turks and Caicos,Fiona,2022
133,2022-09-27,110.0,947.0,Cuba,Ian,2022
134,2022-10-09,75.0,982.0,Nicaragua,Julia,2022
135,2022-11-09,65.0,980.0,Bahamas,Nicole,2022

In [247]:
hurricanes_non_us_landfalls_df.to_csv('International_Atlantic_Hurricane_Landfalls_cleaned.csv', index=False)

### USA Landfalls

Hurricane data source for [USA landfalls](https://www.aoml.noaa.gov/hrd/hurdat/All_U.S._Hurricanes.html).

In [248]:
hurricanes_usa_landfalls_df = pd.read_csv('USA_Hurricane_Landfalls.csv', delimiter='\t')
hurricanes_usa_landfalls_df.head()

,Year,Month,States Affected and Category by States,Highest Saffir-Simpson U.S. Category,Central Pressure(mb),Max Wind(kt),Name
0,1991,Aug,"RI, 2; MA, 2; NY, 2; CT, 2",2,962,90,Bob
1,1992,Aug,"FL, SE5, SW4; LA, 3",5,922,145,Andrew
2,1993,Aug,"* NC, 3",3,961,100,Emily
3,1995,Aug,"FL, NW2, SE1",2,973,85,Erin
4,1995,Oct,"FL, NW3, I-AL 1",3,942,100,Opal

In [249]:
hurricanes_usa_landfalls_df = hurricanes_usa_landfalls_df.drop(columns=['States Affected and Category by States', 'Highest Saffir-Simpson U.S. Category', 'Month']).dropna().drop_duplicates()
hurricanes_usa_landfalls_df.reset_index(drop=True, inplace=True)
hurricanes_usa_landfalls_df.head()

   Year  Central Pressure(mb)  Max Wind(kt)    Name
0  1991                   962            90     Bob
1  1992                   922           145  Andrew
2  1993                   961           100   Emily
3  1995                   973            85    Erin
4  1995                   942           100    Opal

In [250]:
max_wind = hurricanes_usa_landfalls_df.pop('Max Wind(kt)')
hurricanes_usa_landfalls_df['Max Winds(kt)'] = max_wind
hurricanes_usa_landfalls_df.head()

   Year  Central Pressure(mb)    Name  Max Winds(kt)
0  1991                   962     Bob             90
1  1992                   922  Andrew            145
2  1993                   961   Emily            100
3  1995                   973    Erin             85
4  1995                   942    Opal            100

In [251]:
name = hurricanes_usa_landfalls_df.pop('Name')
hurricanes_usa_landfalls_df['Storm Names'] = name
hurricanes_usa_landfalls_df['Landfall Country'] = 'USA'
hurricanes_usa_landfalls_df.head()

   Year  Central Pressure(mb)  Max Winds(kt) Storm Names Landfall Country
0  1991                   962             90         Bob              USA
1  1992                   922            145      Andrew              USA
2  1993                   961            100       Emily              USA
3  1995                   973             85        Erin              USA
4  1995                   942            100        Opal              USA

In [252]:
hurricanes_usa_landfalls_df.to_csv('USA_Hurricane_Landfalls_cleaned.csv', index=False)

Tropical Storm data source for [International landfalls](https://www.aoml.noaa.gov/hrd/hurdat/International_Storms.html).

In [253]:
tropical_storms_non_usa_landfalls_df = pd.read_csv('International_Tropical_Storm_Landfalls.csv', parse_dates=['Date'], infer_datetime_format=True, delimiter='\t')
tropical_storms_non_usa_landfalls_df.head()

/var/folders/b7/jtfw7lbj0mn18fznly0bdtq00000gn/T/ipykernel_2504/3937688483.py:1: FutureWarning: The argument 'infer_datetime_format' is deprecated and will be removed in a future version. A strict version of it is now the default, see https://pandas.pydata.org/pdeps/0004-consistent-to-datetime-parsing.html. You can safely remove this argument.
  tropical_storms_non_usa_landfalls_df = pd.read_csv('International_Tropical_Storm_Landfalls.csv', parse_dates=['Date'], infer_datetime_format=True, delimiter='\t')

,#,Name,Date,Time,Latitude (N),Longitude (W),Max Winds (kt),Landfall Country
0,8,Erika,1991-09-12,0300Z,37.7,25.9,35,Azores
1,9,Fabian,1991-10-15,2100Z,21.5,82.8,40,Cuba
2,9,Fabian,1991-10-16,0000Z,22.3,81.9,40,Cuba
3,12,Unnamed,1991-11-02,1400Z,44.6,63.5,45,Canada
4,6,Charley,1992-09-27,1000Z,38.7,27.1,55,Azores

In [254]:
tropical_storms_non_usa_landfalls_df['Year'] = tropical_storms_non_usa_landfalls_df['Date'].dt.year
tropical_storms_non_usa_landfalls_df

,#,Name,Date,Time,Latitude (N),Longitude (W),Max Winds (kt),Landfall Country,Year
0,8,Erika,1991-09-12,0300Z,37.7,25.9,35,Azores,1991
1,9,Fabian,1991-10-15,2100Z,21.5,82.8,40,Cuba,1991
2,9,Fabian,1991-10-16,0000Z,22.3,81.9,40,Cuba,1991
3,12,Unnamed,1991-11-02,1400Z,44.6,63.5,45,Canada,1991
4,6,Charley,1992-09-27,1000Z,38.7,27.1,55,Azores,1992
...,...,...,...,...,...,...,...,...,...
118,7,Grace,2021-08-16,1630Z,17.7,71.4,35,Doninican Republic,2021
119,7,Grace,2021-08-17,1400Z,18.2,76.6,50,Jamaica,2021
120,2,Bonnie,2022-07-02,0300Z,11.0,83.8,50,Nicaragua,2022
121,7,Fiona,2022-09-16,2315Z,16.4,61.4,50,Guadeloupe,2022
122,17,Nicole,2022-11-09,1700Z,26.5,77.1,60,Bahamas,2022

In [255]:
tropical_storms_non_usa_landfalls_df = tropical_storms_non_usa_landfalls_df.drop(columns=['#', 'Time', 'Latitude (N)', 'Longitude (W)']).dropna().drop_duplicates()
tropical_storms_non_usa_landfalls_df.reset_index(drop=True, inplace=True)
tropical_storms_non_usa_landfalls_df.head()

      Name       Date  Max Winds (kt) Landfall Country  Year
0    Erika 1991-09-12              35           Azores  1991
1   Fabian 1991-10-15              40             Cuba  1991
2   Fabian 1991-10-16              40             Cuba  1991
3  Unnamed 1991-11-02              45           Canada  1991
4  Charley 1992-09-27              55           Azores  1992

In [256]:
max_wind = tropical_storms_non_usa_landfalls_df.pop('Max Winds (kt)')
tropical_storms_non_usa_landfalls_df['Max Winds(kt)'] = max_wind
tropical_storms_non_usa_landfalls_df.head()

      Name       Date Landfall Country  Year  Max Winds(kt)
0    Erika 1991-09-12           Azores  1991             35
1   Fabian 1991-10-15             Cuba  1991             40
2   Fabian 1991-10-16             Cuba  1991             40
3  Unnamed 1991-11-02           Canada  1991             45
4  Charley 1992-09-27           Azores  1992             55

In [257]:
tropical_storms_non_usa_landfalls_df.to_csv('International_Tropical_Storm_Landfalls_Cleaned.csv', index=False)

In [258]:
tropical_storms_usa_landfalls_df = pd.read_csv('USA_Tropical_Storm_Landfalls.csv', parse_dates=['Date'], infer_datetime_format=True, delimiter='\t')
tropical_storms_usa_landfalls_df.head()

/var/folders/b7/jtfw7lbj0mn18fznly0bdtq00000gn/T/ipykernel_2504/1676421321.py:1: FutureWarning: The argument 'infer_datetime_format' is deprecated and will be removed in a future version. A strict version of it is now the default, see https://pandas.pydata.org/pdeps/0004-consistent-to-datetime-parsing.html. You can safely remove this argument.
  tropical_storms_usa_landfalls_df = pd.read_csv('USA_Tropical_Storm_Landfalls.csv', parse_dates=['Date'], infer_datetime_format=True, delimiter='\t')

,Storm #,Date,Time,Lat,Lon,Max Winds(kt),LandfallState,Storm Names
0,3,1991-08-20,0130Z,44.1,69.1,60,ME,Bob
1,7,1992-09-25,2200Z,37.8,75.5,55,VA,Danielle
2,2,1993-06-20,0900Z,27.1,97.4,35,TX,Arlene
3,1,1994-07-03,1500Z,30.4,86.5,55,FL,Alberto
4,3,1994-08-16,0000Z,30.0,85.6,50,FL,Beryl

In [259]:
tropical_storms_usa_landfalls_df['Year'] = tropical_storms_usa_landfalls_df['Date'].dt.year
tropical_storms_non_usa_landfalls_df

        Name       Date    Landfall Country  Year  Max Winds(kt)
0      Erika 1991-09-12              Azores  1991             35
1     Fabian 1991-10-15                Cuba  1991             40
2     Fabian 1991-10-16                Cuba  1991             40
3    Unnamed 1991-11-02              Canada  1991             45
4    Charley 1992-09-27              Azores  1992             55
..       ...        ...                 ...   ...            ...
117    Grace 2021-08-16  Doninican Republic  2021             35
118    Grace 2021-08-17             Jamaica  2021             50
119   Bonnie 2022-07-02           Nicaragua  2022             50
120    Fiona 2022-09-16          Guadeloupe  2022             50
121   Nicole 2022-11-09             Bahamas  2022             60

[122 rows x 5 columns]

In [260]:
tropical_storms_usa_landfalls_df = tropical_storms_usa_landfalls_df.drop(columns=['Storm #', 'Time', 'Lat', 'Lon', 'LandfallState']).dropna().drop_duplicates()
tropical_storms_usa_landfalls_df.reset_index(drop=True, inplace=True)
tropical_storms_usa_landfalls_df.head()

        Date  Max Winds(kt) Storm Names  Year
0 1991-08-20             60         Bob  1991
1 1992-09-25             55    Danielle  1992
2 1993-06-20             35      Arlene  1993
3 1994-07-03             55     Alberto  1994
4 1994-08-16             50       Beryl  1994

In [261]:
tropical_storms_usa_landfalls_df.to_csv('USA_Tropical_Storm_Landfalls_Cleaned.csv', index=False)

Tropical Storm data source for [USA landfalls](https://www.aoml.noaa.gov/hrd/hurdat/uststorms.html).